# Host: localhost  (Version 5.5.5-10.2.7-MariaDB-log)
# Date: 2018-05-30 14:26:02
# Generator: MySQL-Front 6.0  (Build 2.20)


#
# Structure for table "migrations"
#

CREATE TABLE `migrations` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

#
# Data for table "migrations"
#

INSERT INTO `migrations` VALUES (5,'2014_10_12_000000_create_users_table',1),(6,'2014_10_12_100000_create_password_resets_table',1),(7,'2018_05_21_063412_create_products_table',1),(8,'2018_05_21_064118_create_records_table',1);

#
# Structure for table "password_resets"
#

CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  KEY `password_resets_email_index` (`email`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

#
# Data for table "password_resets"
#


#
# Structure for table "products"
#

CREATE TABLE `products` (
  `product_id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `status` int(11) DEFAULT NULL,
  `min_amount` int(11) DEFAULT NULL,
  `shelf` int(11) DEFAULT NULL,
  `risk` int(11) DEFAULT NULL,
  `rank` int(11) DEFAULT NULL,
  `life` int(11) DEFAULT NULL,
  `product_start` date DEFAULT NULL,
  `product_end` date DEFAULT NULL,
  `min_rate` int(11) DEFAULT NULL,
  `max_rate` int(11) DEFAULT NULL,
  `area` int(11) DEFAULT NULL,
  `bank` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `product_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `introduction` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`product_id`)
) ENGINE=InnoDB AUTO_INCREMENT=120 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

#
# Data for table "products"
#

INSERT INTO `products` VALUES (1,3,100000,0,2,0,1096,'2018-01-04','2019-01-04',560,560,0,'杭州银行','丰裕2号第2165期预约1096天型','非保本浮动收益型理财业务',NULL,NULL),(2,3,50000,0,3,0,91,'2018-01-04','2019-01-05',555,555,0,'杭州银行','丰裕1号第3869期预约91天型(新客户专属)','非保本浮动收益型理财业务',NULL,NULL),(3,3,50000,0,3,0,728,'2018-01-04','2019-01-06',550,550,0,'杭州银行','丰裕1号第3868期预约728天型','非保本浮动收益型理财业务',NULL,NULL),(4,3,100000,0,2,0,364,'2018-01-04','2019-01-07',530,540,0,'杭州银行','丰裕2号第2164期预约364天型','非保本浮动收益型理财业务',NULL,NULL),(5,3,50000,0,3,0,364,'2018-01-04','2019-01-08',540,540,0,'杭州银行','丰裕1号第3872期预约364天型(村镇专属)','非保本浮动收益型理财业务',NULL,NULL),(6,3,100000,0,2,0,182,'2018-01-04','2019-01-09',535,535,0,'杭州银行','丰裕2号第2163期预约182天型','非保本浮动收益型理财业务',NULL,NULL),(7,3,50000,0,3,0,182,'2018-01-04','2019-01-10',520,530,0,'杭州银行','丰裕1号第3871期预约182天型(村镇专属)','非保本浮动收益型理财业务',NULL,NULL),(8,3,50000,0,3,0,364,'2018-01-04','2019-01-11',530,530,0,'杭州银行','丰裕1号第3867期预约364天型','非保本浮动收益型理财业务',NULL,NULL),(9,3,50000,0,3,0,91,'2018-01-04','2019-01-12',525,530,0,'杭州银行','丰裕1号第3870期预约91天型(找财猫专属)','非保本浮动收益型理财业务',NULL,NULL),(10,3,100000,0,2,0,91,'2018-01-04','2019-01-13',525,525,0,'杭州银行','丰裕2号第2162期预约91天型','非保本浮动收益型理财业务',NULL,NULL),(11,3,50000,0,3,0,269,'2018-01-04','2019-01-14',515,525,0,'杭州银行','丰裕1号第3866期预约269天型','非保本浮动收益型理财业务',NULL,NULL),(12,3,50000,0,3,0,182,'2018-01-04','2019-01-15',525,525,0,'杭州银行','丰裕1号第3865期预约182天型','非保本浮动收益型理财业务',NULL,NULL),(13,3,50000,0,3,0,91,'2018-01-04','2019-01-16',515,525,0,'杭州银行','丰裕1号第3864期预约91天型','非保本浮动收益型理财业务',NULL,NULL),(14,3,100000,0,2,0,63,'2018-01-04','2019-01-17',515,520,0,'杭州银行','丰裕2号第2161期预约63天型','非保本浮动收益型理财业务',NULL,NULL),(15,3,100000,0,2,0,35,'2018-01-04','2019-01-18',515,520,0,'杭州银行','丰裕2号第2160期预约35天型','非保本浮动收益型理财业务',NULL,NULL),(16,3,50000,0,3,0,63,'2018-01-04','2019-01-19',510,515,0,'杭州银行','丰裕1号第3863期预约63天型','非保本浮动收益型理财业务',NULL,NULL),(17,3,50000,0,3,0,35,'2018-01-04','2019-01-20',495,515,0,'杭州银行','丰裕1号第3862期预约35天型','非保本浮动收益型理财业务',NULL,NULL),(18,4,50000,0,3,0,29890,'2018-01-04','2019-01-21',495,505,0,'杭州银行','灵动添益7天开放式银行理财计划','非保本浮动收益型理财业务',NULL,NULL),(19,3,50000,0,4,0,364,'2018-01-04','2019-01-22',495,505,0,'杭州银行','稳健1号第1507期预约364天型','保本浮动收益型理财业务',NULL,NULL),(20,3,50000,0,4,0,182,'2018-01-04','2019-01-23',495,500,0,'杭州银行','稳健1号第1506期预约182天型','保本浮动收益型理财业务',NULL,NULL),(21,3,50000,0,4,0,91,'2018-01-04','2019-01-24',485,490,0,'杭州银行','稳健1号第1505期预约91天型','保本浮动收益型理财业务',NULL,NULL),(22,3,50000,0,4,0,42,'2018-01-04','2019-01-25',440,440,0,'杭州银行','稳健1号第1504期预约42天型','保本浮动收益型理财业务',NULL,NULL),(23,4,100000,0,1,0,1826,'2018-01-04','2019-01-26',0,0,0,'杭州银行','丰睿系列股票精选第1期理财计划','非保本浮动收益型理财业务',NULL,NULL),(24,3,50000,0,3,0,3652,'2018-01-04','2019-01-27',310,310,0,'杭州银行','丰裕盈家月添益银行理财计划','非保本浮动收益型理财业务',NULL,NULL),(25,3,50000,0,4,0,100,'2018-01-04','2019-01-28',300,300,0,'温州银行','“金鹿理财-金元宝”','投资类型属于混合类理财产品，收益类型为非保本浮动收益型，运作模式为封闭式非净值型',NULL,NULL),(26,3,50000,0,4,0,94,'2018-01-04','2019-01-29',290,290,0,'温州银行','“金鹿理财-季季红”','投资类型属于债券类理财产品，收益类型为非保本浮动收益型，运作模式为封闭式非净值型',NULL,NULL),(27,3,50000,0,4,0,60,'2018-01-04','2019-01-30',280,280,0,'温州银行','“金鹿理财-乐得富”','投资类型属于混合类理财产品，收益类型为非保本浮动收益型，运作模式为封闭式非净值型',NULL,NULL),(28,3,50000,0,1,0,94,'2018-01-04','2019-01-31',9660,9660,0,'温州银行','“金鹿理财-温润”','投资类型属于债券类理财产品，收益类型为保本浮动收益型，运作类型为封闭式非净值型',NULL,NULL),(29,3,50000,0,4,0,45,'2018-01-04','2019-02-01',0,0,0,'温州银行','“金鹿理财-六六顺”','投资类型属于债券类理财产品，收益类型为非保本浮动收益型，运作模式为封闭式非净值型',NULL,NULL),(30,4,0,1,0,0,360,'0000-00-00','0000-00-00',650,650,0,'湖州银行','百合花理财1号','',NULL,NULL),(31,4,0,1,0,0,180,'0000-00-00','0000-00-00',600,600,0,'湖州银行','百合花理财2号','',NULL,NULL),(32,4,0,1,0,0,360,'0000-00-00','0000-00-00',650,650,0,'湖州银行','百合花理财3号','',NULL,NULL),(33,4,0,1,0,0,360,'0000-00-00','0000-00-00',420,420,0,'湖州银行','百合花理财4号','',NULL,NULL),(34,4,0,1,0,0,540,'0000-00-00','0000-00-00',520,520,0,'湖州银行','百合花理财5号','',NULL,NULL),(35,4,0,1,0,0,180,'0000-00-00','0000-00-00',400,400,0,'湖州银行','百合花理财6号','',NULL,NULL),(36,4,0,1,0,0,270,'0000-00-00','0000-00-00',410,410,0,'湖州银行','百合花理财7号','',NULL,NULL),(37,4,0,1,0,0,540,'0000-00-00','0000-00-00',550,550,0,'湖州银行','百合花理财8号','',NULL,NULL),(38,4,0,1,0,0,540,'0000-00-00','0000-00-00',600,600,0,'湖州银行','百合花理财1001号','',NULL,NULL),(39,3,50000,0,4,0,96,'2018-01-04','2018-01-04',549,549,0,'浙商银行股份有限公司','“永乐1号”人民币理财产品96天型AB1208','非保本浮动收益型',NULL,NULL),(40,3,50000,0,4,0,96,'2018-01-04','2018-01-04',549,549,0,'浙商银行股份有限公司','“永乐1号”人民币理财产品96天型AB1206','非保本浮动收益型',NULL,NULL),(41,3,50000,0,5,0,96,'2018-01-04','2018-01-04',551,551,0,'浙商银行股份有限公司','“永乐2号”人民币理财产品96天型BB1196','非保本浮动收益型',NULL,NULL),(42,3,50000,0,5,0,96,'2018-01-04','2018-01-04',551,551,0,'浙商银行股份有限公司','“永乐2号”人民币理财产品96天型BB1195','非保本浮动收益型',NULL,NULL),(43,3,1000000,0,5,0,187,'2018-01-04','2018-01-04',560,560,0,'浙商银行股份有限公司','“永乐5号”人民币理财产品187天型DC2017','非保本浮动收益型',NULL,NULL),(44,3,1000000,0,3,0,63,'2018-01-04','2018-01-04',540,540,0,'浙江民泰商业银行','益民理财•“聚鑫”理财计划002号百万专享版','非保本浮动收益型',NULL,NULL),(45,3,50000,0,3,0,49,'2018-01-04','2018-01-04',490,490,0,'浙江民泰商业银行','益民理财•“安鑫”理财计划267号','非保本浮动收益型',NULL,NULL),(46,3,50000,0,3,0,364,'2018-01-04','2018-01-04',530,530,0,'浙江民泰商业银行','益民理财·“汇鑫”理财计划023号','非保本浮动收益型',NULL,NULL),(47,3,50000,0,3,0,189,'2018-01-04','2018-01-04',510,510,0,'浙江民泰商业银行','益民理财·“盈鑫”理财计划371号','非保本浮动收益型',NULL,NULL),(48,3,50000,0,3,0,233,'1900-01-20','1900-01-20',525,525,1,'四川天府银行','“熊猫理财”功夫系列D计划理财产品106期子产品','适用于谨慎型、稳健型、进取型及激进型个人客户及机构客户',NULL,NULL),(49,3,50000,0,3,0,142,'1900-01-20','1900-01-20',535,535,1,'四川天府银行','“熊猫理财”功夫系列C计划理财产品148期子产品','适用于谨慎型、稳健型、进取型及激进型个人客户及机构客户',NULL,NULL),(50,3,50000,0,3,0,208,'1900-01-20','1900-01-20',525,525,1,'长城华西银行','长城理财之长城四号2018-025期理财产品','适合于经我行风险评估为稳健型、平衡型、成长型、进取型的有投资经验的个人，机构客户。',NULL,NULL),(51,3,50000,0,4,0,188,'1900-01-20','1900-01-20',420,420,1,'长城华西银行','长城理财之安享人生2018-018期理财产品','适合于经我行内部风险评估为保守型、稳健型、平衡型、成长型、 进取型的有投资经验和无投资经验的个人客户。',NULL,NULL),(52,3,50000,0,3,0,121,'1900-01-20','1900-01-20',520,520,1,'长城华西银行','长城理财之长城四号2018-024期理财产品','适合于经我行风险评估为稳健型、平衡型、成长型、进取型的有投资经验的个人，机构客户。',NULL,NULL),(53,4,50000,0,3,0,5460,'1900-01-20','1900-01-20',500,500,1,'长城华西银行','长城华西银行之季季增利系列2017-555期人民币理财产品','适合于经我行风险评估为稳健型、平衡型、成长型、进取型的有投资经验和无投资经验的个人，机构客户。',NULL,NULL),(54,4,50000,0,3,0,3650,'1900-01-20','1900-01-20',360,360,1,'长城华西银行','长城华西银行之个人客户专属日日鑫人民币理财产品','适合于经我行风险评估为稳健型、平衡型、成长型、进取型的有投资经验和无投资经验的个人客户。',NULL,NULL),(55,4,50000,0,4,0,728,'1900-01-20','1900-01-20',220,220,1,'长城华西银行','长城华西银行2016年旌喜之日日鑫人民币理财产品','适合于经我行风险评估为保守型、稳健型、平衡型、成长型、进取型的有投资经验和无投资经验的个人客户。',NULL,NULL),(56,0,50000,0,4,0,367,'1900-01-20','1900-01-20',415,415,0,'瑞丰银行','禧瑞C18018期人民币理财产品','无经验投资者和有经验投资者均可认购',NULL,NULL),(57,0,50000,0,4,0,357,'1900-01-20','1900-01-20',415,415,0,'瑞丰银行','禧瑞C18038期人民币理财产品','无经验投资者和有经验投资者均可认购',NULL,NULL),(58,0,50000,0,4,0,357,'1900-01-20','1900-01-20',415,415,0,'瑞丰银行','禧瑞C18043期人民币理财产品','无经验投资者和有经验投资者均可认购',NULL,NULL),(59,0,50000,0,4,0,364,'1900-01-20','1900-01-20',415,415,0,'瑞丰银行','禧瑞C18033期人民币理财产品','无经验投资者和有经验投资者均可认购',NULL,NULL),(60,0,1000000,0,4,0,518,'1900-01-20','1900-01-20',455,455,0,'瑞丰银行','金瑞K17012期人民币理财产品','无经验投资者和有经验投资者均可认购',NULL,NULL),(61,0,50000,0,4,0,508,'1900-01-20','1900-01-20',450,450,0,'瑞丰银行','禧瑞C17103期人民币理财产品','无经验投资者和有经验投资者均可认购',NULL,NULL),(62,0,50000,0,4,0,507,'1900-01-20','1900-01-20',450,450,0,'瑞丰银行','禧瑞C17106期人民币理财产品','无经验投资者和有经验投资者均可认购',NULL,NULL),(63,0,1000000,0,4,0,518,'1900-01-20','1900-01-20',455,455,0,'瑞丰银行','金瑞K17016期人民币理财产品','无经验投资者和有经验投资者均可认购',NULL,NULL),(64,1,50000,0,4,0,97,'1900-01-20','1900-01-20',500,500,0,'海宁农商银行','海宁农商银行“丰收·信福” 2018011期人民币理财产品','非保本浮动收益型',NULL,NULL),(65,1,50000,0,4,0,95,'1900-01-20','1900-01-20',500,500,0,'海宁农商银行','海宁农商银行“丰收•信福”2018010期人民币理财产品','非保本浮动收益型',NULL,NULL),(66,1,50000,0,4,0,91,'1900-01-20','1900-01-20',500,500,0,'海宁农商银行','海宁农商银行“丰收·信福” 2018009期人民币理财产品','非保本浮动收益型',NULL,NULL),(67,1,100000,0,2,0,274,'1900-01-20','1900-01-20',530,530,0,'余杭农商银行','“丰收•丰叶B”2018年第38期人民币理财产品（0净值客户版）','适合平衡型及以上的0净值客户。',NULL,NULL),(68,1,1000000,0,2,0,372,'1900-01-20','1900-01-20',540,540,0,'余杭农商银行','“丰收•丰叶B”2018年第36期人民币理财产品','适合平衡型及以上的0净值客户、机构客户。',NULL,NULL),(69,1,1000000,0,2,0,365,'1900-01-20','1900-01-20',540,540,0,'余杭农商银行','“丰收•丰叶B”2018年第39期人民币理财产品','适合平衡型及以上的0净值客户、机构客户。',NULL,NULL),(70,1,1000000,0,2,0,364,'1900-01-20','1900-01-20',530,530,0,'余杭农商银行','“丰收•丰叶B”2018年第21期人民币理财产品','适合平衡型及以上的0净值客户、机构客户。',NULL,NULL),(71,1,50000,0,3,0,91,'1900-01-20','1900-01-20',510,510,0,'余杭农商银行','“丰收•丰叶A”2018年第37期人民币理财产品','适合平衡型及以上的个人客户。',NULL,NULL),(72,1,1000000,0,2,0,364,'1900-01-20','1900-01-20',540,540,0,'余杭农商银行','“丰收•丰叶B”2018年第30期人民币理财产品','适合平衡型及以上的0净值客户、机构客户。',NULL,NULL),(73,4,50000,0,3,0,365,'1900-01-20','1900-01-20',508,508,1,'成都农商银行','天府理财之“增富”理财产品（ZFG18095-蓉e一号）','针对稳健型客户群体的理财需求推出的5风险理财产品，资产投向以0信用等级债券为主，配合其他标准化资产，在稳健2寻求收益，让您理手2之财，分盛世之红，体验实时“增富”',NULL,NULL),(74,4,50000,0,3,0,366,'1900-01-20','1900-01-20',540,540,1,'成都农商银行','天府理财之“增富”理财产品（ZFG18100-智享）','针对稳健型客户群体的理财需求推出的5风险理财产品，资产投向以0信用等级债券为主，配合其他标准化资产，在稳健2寻求收益，让您理手2之财，分盛世之红，体验实时“增富”',NULL,NULL),(75,4,50000,0,3,0,367,'1900-01-20','1900-01-20',380,380,1,'成都农商银行','天府理财之“双周盈”理财产品（DKG18001）','为满足稳健型客户群体较0的流动性管理需求推出的产品，按14天为一个运作周期，每个周期内一段时间开放申购与赎回，客户可以灵活的持有或赎回产品，并按运作周期天数和预期收益率获取收益',NULL,NULL),(76,4,50000,0,4,0,368,'1900-01-20','1900-01-20',310,310,1,'成都农商银行','天府理财之“安心”理财产品（AXG18002）','针对保守型客户群体的理财需求推出的6风险理财产品，资产投向以货币市场工具为主，在保持本金0安全性的前提下，兼顾资金的流动性与收益性。让您轻松保本稳健赚，风险超4得安全，实现真正“安心”',NULL,NULL),(77,4,200000,0,3,0,369,'1900-01-20','1900-01-20',520,520,1,'成都农商银行','天府理财之“至尊”理财产品（ZZG18001-私银专享）','针对稳健型客户群体的理财需求推出的3风险理财产品，资产投向在控制风险的前提下更加选择多样，同时通过科学的资产配置手段分散风险、均衡收益，让您体验非凡收益，成就金色生活，享受王者“至尊”。',NULL,NULL),(78,4,50000,0,3,0,370,'1900-01-20','1900-01-20',480,480,1,'泸州市商业银行','“金桂花”理财2017年第6期','有着较0的年化净收益率，较长的理财周期。',NULL,NULL),(79,4,50000,0,3,0,371,'1900-01-20','1900-01-20',456,456,1,'攀枝花市商业银行','金色攀枝花系列“季季红”A款人民币理财产品','一个季度为一个周期，用户如果觉得实惠，可以下个季度继续购买，为此本产品系列叫做“季季红”，希望该产品每季度都值得购买。',NULL,NULL),(80,4,50000,0,3,0,372,'1900-01-20','1900-01-20',550,550,1,'攀枝花市商业银行','金色攀枝花系列“锦上添花”人民币理财产品 ','特点是较0的年化净收益率，达到5.50%，还有较长的理财周期，在资金充足，时间空闲的情况下，该理财产品的性价比还是很可观的。',NULL,NULL),(81,4,50000,0,3,0,373,'1900-01-20','1900-01-20',460,460,1,'攀枝花市商业银行','金色攀枝花系列“双月喜”B款人民币理财产品','每两个月为一个周期，适合谨慎小心的客户购买，用户如果觉得实惠，可以下一个双月继续购买。',NULL,NULL),(82,4,50000,0,3,0,374,'1900-01-20','1900-01-20',456,456,1,'攀枝花市商业银行','金色攀枝花系列“双月喜”A款人民币理财产品','每两个月为一个周期，适合谨慎小心的客户购买，用户如果觉得实惠，可以下一个双月继续购买。',NULL,NULL),(83,4,50000,0,3,0,375,'1900-01-20','1900-01-20',530,530,1,'攀枝花市商业银行','金色攀枝花系列“锦上添花”人民币理财产品（春节专属）','特点是较0的年化净收益率，达到5.50%，还有较长的理财周期，在资金充足，时间空闲的情况下，该理财产品的性价比还是很可观的。',NULL,NULL),(84,4,50000,0,4,0,376,'1900-01-20','1900-01-20',450,450,1,'成都银行','“芙蓉锦程·双月得益”开放式人民币理财产品','每两个月为一个周期，适合谨慎的客户购买。',NULL,NULL),(85,4,50000,0,4,0,377,'1900-01-20','1900-01-20',410,410,1,'成都银行','成都银行“芙蓉锦程·稳得益”人民币理财产品','针对稳健型客户群体的理财需求推出的5风险理财产品，较长的理财周期，适合想稳定理财的用户，故名为“稳得益”。',NULL,NULL),(86,4,50000,0,4,0,378,'1900-01-20','1900-01-20',480,480,1,'成都银行','成都银行“芙蓉锦程·汇得益”人民币理财产品','针对稳健型客户群体的理财需求推出的5风险理财产品。',NULL,NULL),(87,4,50000,0,3,0,379,'1900-01-20','1900-01-20',512,512,1,'成都银行','成都银行“芙蓉锦程·专享”人民币理财产品（0净值客户专享）','针对稳健型客户群体的理财需求推出的5风险理财产品，0净值客户专享。',NULL,NULL),(88,4,50000,0,3,0,380,'1900-01-20','1900-01-20',510,510,1,'成都银行','成都银行“芙蓉锦程·季季得益”人民币理财产品','针对稳健型客户群体的理财需求推出的5风险理财产品，一个季度为一个周期，用户如果觉得实惠，可以下个季度继续购买。',NULL,NULL),(89,4,50000,0,6,0,381,'1900-01-20','1900-01-20',400,400,1,'四川省农村信用联社','金信富喜雁保本浮动收益型理财产品','针对稳健型客户群体的理财需求推出的6风险理财产品。',NULL,NULL),(90,4,50000,0,6,0,382,'1900-01-20','1900-01-20',470,470,1,'四川省农村信用联社','状元红开盈保本型理财产品','针对稳健型客户群体的理财需求推出的6风险理财产品。',NULL,NULL),(91,4,50000,0,6,0,383,'1900-01-20','1900-01-20',435,435,1,'四川省农村信用联社','金元帅—货币非保本浮动收益型理财产品','针对稳健型客户群体的理财需求推出的6风险理财产品。',NULL,NULL),(92,4,50000,0,4,0,384,'1900-01-20','1900-01-20',459,459,1,'四川省农村信用联社','充国园绿色共享保本浮动收益型理财产品','针对稳健型客户群体的理财需求推出的5风险理财产品。',NULL,NULL),(93,4,50000,0,4,0,385,'1900-01-20','1900-01-20',480,480,1,'四川省农村信用联社','财汇盈添金保本浮动收益型理财产品','针对稳健型客户群体的理财需求推出的5风险理财产品。',NULL,NULL),(94,3,50000,0,2,0,156,'2018-04-24','2018-09-27',490,490,2,'甘肃银行','“汇福”2018年第47期个人理财产品（e专享） ','“汇福”个人人民币理财产品是甘肃银行在2013年3月推出的个人人民币系列产品，分为保本保收益型、保本浮动收益型、非保本浮动收益型三种。',NULL,NULL),(95,3,50000,0,0,0,364,'2018-04-26','2019-04-25',415,415,2,'甘肃银行','“汇福”2018年第49期个人理财产品','“汇福”个人人民币理财产品是甘肃银行在2013年3月推出的个人人民币系列产品，分为保本保收益型、保本浮动收益型、非保本浮动收益型三种。',NULL,NULL),(96,3,50000,0,0,0,182,'2018-04-26','2018-10-25',410,410,2,'甘肃银行','“汇福”2018年第48期个人理财产品\n','“汇福”个人人民币理财产品是甘肃银行在2013年3月推出的个人人民币系列产品，分为保本保收益型、保本浮动收益型、非保本浮动收益型三种。',NULL,NULL),(97,2,50000,1,2,0,63,'2018-04-26','2018-06-28',495,495,2,'甘肃银行','“汇福”周周赢42D定期开放式个人理财产品(201816)','“汇福”个人人民币理财产品是甘肃银行在2013年3月推出的个人人民币系列产品，分为保本保收益型、保本浮动收益型、非保本浮动收益型三种。',NULL,NULL),(98,3,50000,0,2,0,273,'2018-04-26','2018-01-24',525,525,2,'甘肃银行','“汇福”周周赢9M定期开放式个人理财产品(201816)','“汇福”个人人民币理财产品是甘肃银行在2013年3月推出的个人人民币系列产品，分为保本保收益型、保本浮动收益型、非保本浮动收益型三种。',NULL,NULL),(99,3,50000,0,0,0,103,'2018-05-03','2018-08-10',490,490,2,'兰州银行','2018年百合理财稳健系列1050号','本理财产品募集上限32000000.00元整。如果理财计划约定规模限额，3募集资金在规模限额区间内时，银行以实际募集金额宣布本理财计划成立。如募集规模未达到规模下限时，银行有权宣布本理财计划不成立。如理财计划不成立，银行将在原定产品成立日后1-3个工作日内将已扣划的理财资金返还到投资者本人的理财资金扣款账户，产品成立日至退还理财资金到账日期间不计付利息。如募集规模提前达到规模上限时，银行将提前终止募集。',NULL,NULL),(100,3,50000,0,0,0,368,'2018-05-04','2019-05-07',430,430,2,'兰州银行','2018年百合理财家计划系列0068号','本理财产品募集上限400000000.00元整。如果理财计划约定规模限额，3募集资金在规模限额区间内时，银行以实际募集金额宣布本理财计划成立。如募集规模未达到规模下限时，银行有权宣布本理财计划不成立。如理财计划不成立，银行将在原定产品成立日后1-3个工作日内将已扣划的理财资金返还到投资者本人的理财资金扣款账户，产品成立日至退还理财资金到账日期间不计付利息。如募集规模提前达到规模上限时，银行将提前终止募集。',NULL,NULL),(101,3,50000,0,0,0,61,'2018-05-03','2018-07-03',500,500,3,'湖北银行','紫气东来稳健系列780期','主要投资于银行间市场债券（包括国债、金融债、央票、企业债、2期债券以及短期融资券等）、同业存款、货币市场基金、债券基金、资金拆借、回购、票据、信托计划(含信托受益权) 证券公司定向资产管理计划、基金子公司专项资产管理计划等金融资产。',NULL,NULL),(102,3,50000,0,0,0,208,'2018-05-03','2018-11-27',440,440,3,'湖北银行','紫气东来安心系列187期','本系列产品主要投资于银行间信用等级较0的债券、央票、债券回购、银行存款、银行承兑汇票、基本建设项目类信托、物业投资信托、资产证券化类等。',NULL,NULL),(103,3,50000,0,0,0,89,'2018-05-03','2018-07-31',515,515,3,'湖北银行','紫气东来尊享系列254期','本系列产品主要投资于私募股权投资基金、股权投资信托、另类资产（如名贵酒、玉器等）或其收益权、IPO战略配售、定向增发等、上市公司企业0管MBO融资等。',NULL,NULL),(104,3,50000,0,2,0,84,'2018-04-26','2018-07-19',510,510,3,'湖北银行','紫气东来爱家系列086期','本系列产品主要投资于风险相对5，预期收益相对较0的优质资产等。',NULL,NULL),(105,3,2000000,0,2,0,140,'2018-04-26','2018-09-13',520,520,3,'湖北银行','紫气东来尊享系列253期','本系列产品主要投资于私募股权投资基金、股权投资信托、另类资产（如名贵酒、玉器等）或其收益权、IPO战略配售、定向增发等、上市公司企业0管MBO融资等。',NULL,NULL),(106,3,2000000,0,3,0,358,'2018-05-03','2019-04-26',520,520,3,'汉口银行','九通理财至尊系列18078期','信用级别0、流动性较好的金融市场工具，包括但不限于回购、国债、 金融债、央行票据、2期票据、债券远期以及企业债、公司债、短期 融资券、货币及债券型信托资产、次级债、信用债、同业存款、信托 受益权、定向资产管理计划、专项资产管理计划等其他金融资产。 ',NULL,NULL),(107,3,500000,0,3,0,358,'2018-05-03','2019-04-26',515,515,3,'汉口银行','九通理财普盈系列18093期','信用级别0、流动性较好的金融市场工具，包括但不限于回购、国债、 金融债、央行票据、2期票据、债券远期以及企业债、公司债、短期 融资券、货币及债券型信托资产、次级债、信用债、同业存款、信托 受益权、定向资产管理计划、专项资产管理计划等其他金融资产。 ',NULL,NULL),(108,3,500000,0,3,0,155,'2018-04-26','2019-09-28',405,405,3,'汉口银行',' 九通理财安心系列','信用级别0、流动性较好的金融市场工具，包括但不限于回购、国债、 金融债、央行票据、2期票据、债券远期以及企业债、公司债、短期 融资券、货币及债券型信托资产、次级债、信用债、同业存款、信托 受益权、定向资产管理计划、专项资产管理计划等其他金融资产。 ',NULL,NULL),(109,3,500000,0,3,0,147,'2018-04-26','2018-09-20',510,510,3,'汉口银行','九通理财普盈系列 ','信用级别0、流动性较好的金融市场工具，包括但不限于回购、国债、 金融债、央行票据、2期票据、债券远期以及企业债、公司债、短期 融资券、货币及债券型信托资产、次级债、信用债、同业存款、信托 受益权、定向资产管理计划、专项资产管理计划等其他金融资产。 ',NULL,NULL),(110,3,500000,0,3,0,120,'2018-05-03','2018-08-31',400,400,3,'汉口银行',' 九通理财安心系列 ','信用级别0、流动性较好的金融市场工具，包括但不限于回购、国债、 金融债、央行票据、2期票据、债券远期以及企业债、公司债、短期 融资券、货币及债券型信托资产、次级债、信用债、同业存款、信托 受益权、定向资产管理计划、专项资产管理计划等其他金融资产。 ',NULL,NULL),(111,2,500000,1,3,0,113,'2015-08-26','2015-12-17',500,500,3,'湖北省农村信用社','锦囊系列第19期理财产品','信用级别0、流动性较好的金融市场工具，包括但不限于回购、国债、 金融债、央行票据、2期票据、债券远期以及企业债、公司债、短期 融资券、货币及债券型信托资产、次级债、信用债、同业存款、信托 受益权、定向资产管理计划、专项资产管理计划等其他金融资产。 ',NULL,NULL),(112,2,1000,1,7,7,777,'2018-05-01','2018-05-25',66,NULL,2,'金蛋金蛋','金蛋金蛋',NULL,'2018-05-28 06:42:19','2018-05-28 06:42:19'),(113,2,1000,1,7,7,777,'2018-05-01','2018-05-25',66,NULL,2,'金蛋金蛋','金蛋金蛋',NULL,'2018-05-28 06:42:54','2018-05-28 06:42:54'),(114,2,1000,1,7,7,777,'2018-05-01','2018-05-25',66,NULL,2,'金蛋金蛋','金蛋金蛋',NULL,'2018-05-28 06:44:36','2018-05-28 06:44:36'),(115,2,1000,1,7,7,777,'2018-05-01','2018-05-25',66,NULL,2,'金蛋金蛋','金蛋金蛋',NULL,'2018-05-28 06:45:03','2018-05-28 06:45:03'),(116,2,1000,1,7,7,777,'2018-05-01','2018-05-25',66,NULL,2,'金蛋金蛋','金蛋金蛋',NULL,'2018-05-28 06:45:18','2018-05-28 06:45:18'),(117,2,1000,1,7,7,777,'2018-05-01','2018-05-25',66,NULL,2,'金蛋金蛋','金蛋金蛋',NULL,'2018-05-28 06:45:48','2018-05-28 06:45:48'),(118,2,1000,1,7,7,777,'2018-05-01','2018-05-25',66,NULL,2,'金蛋金蛋','金蛋金蛋',NULL,'2018-05-28 06:47:49','2018-05-28 06:47:49'),(119,3,1001,1,5,2,4514,'2018-04-30','2018-05-18',7,NULL,1,'nk km','sknvsk','可以拖动调大小sffd','2018-05-30 02:41:32','2018-05-30 02:41:32');

#
# Structure for table "records"
#

CREATE TABLE `records` (
  `record_id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `product_id` int(11) DEFAULT NULL,
  `admin_id` int(11) NOT NULL DEFAULT 0,
  `admin_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`record_id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

#
# Data for table "records"
#

INSERT INTO `records` VALUES (1,NULL,1700022846,'666666','2018-05-28 06:44:36','2018-05-28 06:44:36'),(2,NULL,1700022846,'666666','2018-05-28 06:45:03','2018-05-28 06:45:03'),(3,NULL,1700022846,'666666','2018-05-28 06:45:18','2018-05-28 06:45:18'),(4,NULL,1700022846,'666666','2018-05-28 06:45:48','2018-05-28 06:45:48'),(5,NULL,1700022846,'666666','2018-05-28 06:47:49','2018-05-28 06:47:49'),(6,118,1700022846,'666666','2018-05-28 07:13:01','2018-05-28 07:13:01'),(7,118,1700022846,'666666','2018-05-28 07:13:36','2018-05-28 07:13:36'),(8,NULL,1700022846,'666666','2018-05-30 02:41:32','2018-05-30 02:41:32'),(9,1,1700022846,'666666','2018-05-30 02:45:09','2018-05-30 02:45:09'),(10,1,1700022846,'666666','2018-05-30 02:45:33','2018-05-30 02:45:33');

#
# Structure for table "users"
#

CREATE TABLE `users` (
  `id` int(10) unsigned NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

#
# Data for table "users"
#

INSERT INTO `users` VALUES (1700022702,'陈媛媛',NULL,'1700022702',NULL,NULL,NULL),(1700022707,'潘卓敏',NULL,'1700022707',NULL,NULL,NULL),(1700022714,'于涓',NULL,'1700022714',NULL,NULL,NULL),(1700022717,'雷楠',NULL,'1700022717',NULL,NULL,NULL),(1700022722,'吴航',NULL,'1700022722',NULL,NULL,NULL),(1700022723,'蒋苇',NULL,'1700022723',NULL,NULL,NULL),(1700022724,'陈筱旸',NULL,'1700022724',NULL,NULL,NULL),(1700022727,'吴文昊',NULL,'1700022727',NULL,NULL,NULL),(1700022729,'曾智聪',NULL,'1700022729',NULL,NULL,NULL),(1700022766,'黄绍珂',NULL,'1700022766',NULL,NULL,NULL),(1700022770,'张灵杰',NULL,'1700022770',NULL,NULL,NULL),(1700022816,'黄豆田',NULL,'1700022816',NULL,NULL,NULL),(1700022828,'薛昌熵',NULL,'1700022828',NULL,NULL,NULL),(1700022845,'周雨洋',NULL,'1700022845',NULL,NULL,NULL),(1700022846,'666666','sd@dsf.com','$2y$10$MzUz3gW/G3MrdLJAbbHCE.CFcazZ4kAjGQKrfyjDZtV3dTPU5SG6y','3JHSgyN7MERy3KeACOj0XJGDYiOxeYrV7U9rFb5YXMBZFRYjbDgHeR7EHd1v','2018-05-21 11:01:12','2018-05-21 11:01:12');
